<?php

use app\commands\migrate\Migration;

/**
 * Class m181219_122702_update_gov_services_duration_and_cooldown
 */
class m181219_122702_update_gov_services_duration_and_cooldown extends Migration
{
    /**
     * {@inheritdoc}
     */
    public function safeUp()
    {
        // Руменко Леонид Андреевич
        // ... установлен duration = 2 и cooldown = 0:

        $services = [
            'Дезинфекция площадей: до 100 кв.м',
            'Дезинфекция площадей: - свыше 100 кв.м до 200 кв.м',
            'Дезинфекция площадей: - свыше 200 кв.м до 500 кв.м',
            'Дезинфекция площадей: - свыше 500 кв.м до 800 кв.м',
            'Дезинфекция площадей: - свыше 800 кв.м до 1000 кв.м',
            'Дезинфекция площадей: - свыше 1000 кв.м до 2000 кв.м',
            'Дезинфекция площадей: - свыше 2000 кв.м до 5000 кв.м',
            'Дезинфекция площадей: - свыше 5000 кв.м до 10000 кв.м',
            'Дезинфекция площадей: - свыше 10000 кв.м',
            'Дератизация: - до 100 кв.м',
            'Дератизация: - свыше 100 кв.м до 200 кв.м',
            'Дератизация: - свыше 200 кв.м до 500 кв.м',
            'Дератизация: - свыше 500 кв.м до 800 кв.м',
            'Дератизация: - свыше 800 кв.м до 1000 кв.м',
            'Дератизация: - свыше 1000 кв.м до 2000 кв.м',
            'Дератизация: - свыше 2000 кв.м до 5000 кв.м',
            'Дератизация: - свыше 5000 кв.м до 10000 кв.м',
            'Дератизация: - свыше 10000 кв.м',
            'Дезинсекция: до 100 кв.м',
            'Дезинсекция: - свыше 100 кв.м до 200 кв.м',
            'Дезинсекция: - свыше 200 кв.м до 500 кв.м',
            'Дезинсекция: - свыше 500 кв.м до 800 кв.м',
            'Дезинсекция: - свыше 800 кв.м до 1000 кв.м',
            'Дезинсекция: - свыше 1000 кв.м до 2000 кв.м',
            'Дезинсекция: - свыше 2000 кв.м до 5000 кв.м',
            'Дезинсекция: - свыше 5000 кв.м до 10000 кв.м',
            'Дезинсекция: - свыше 10000 кв.м',
        ];

        foreach ($services as $name) {
            $govService = \app\models\db\GovServices::findOne(['name' => $name]);
            if ($govService === null) {
                \yii\helpers\Console::output('Not found: ' . $name);
                continue;
            }
            $govService->updateAttributes([
                'duration' => 2,
                'cooldown' => 0,
            ]);
        }
    }

    /**
     * {@inheritdoc}
     */
    public function safeDown()
    {
        echo "m181219_122702_update_gov_services_duration_and_cooldown cannot be reverted.\n";

        return false;
    }
}
